package com.common;

import java.util.HashMap;
import java.util.Map;

import com.cninsure.core.utils.StringUtil;

public class RBorJYCodeUtil {

	
	public final static Map<String, String> data = new HashMap<String, String>();
	static{
		data.put("2085@0","2016");
		data.put("2090@0","2016");
		data.put("2090@0","2016");
		data.put("2073@0","2016");
		data.put("2025@0","2016");
		data.put("2095@0","2016");
		data.put("2023@0","2016");
		data.put("2042@0","2016");
		data.put("2007@0","2016");
		data.put("2016@0","2016");
		data.put("2041@0","2016");
		data.put("2043@0","2016");
		data.put("2046@0","2016");
		data.put("2027@0","2016");
		data.put("2088@0","2016");
		data.put("2044@0","2016");
		data.put("2024@120000","2016");
		data.put("2075@120100","2016");
		data.put("2095@350200","2016");
		data.put("2096@370000","2016");
		data.put("2086@370000","2016");
		data.put("2066@370000","2016");
		data.put("2043@420100","2016");
		data.put("2021@420100","2016");
		data.put("2042@440000","2016");
		data.put("0@110100","2016");
		data.put("0@210000","2016");
		data.put("0@320000","2016");
		data.put("0@330000","2016");
		data.put("0@350200","2016");
		data.put("0@420000","2016");
		data.put("0@430000","2016");
		data.put("0@440300","2016");
		data.put("0@500000","2016");
		data.put("0@510000","2016");
		data.put("0@610000","2016");
		data.put("2077@0","2005");
		data.put("2096@0","2005");
		data.put("2011@0","2005");
		data.put("2022@0","2005");
		data.put("2002@0","2005");
		data.put("2019@0","2005");
		data.put("2021@0","2005");
		data.put("2005@370000","2005");
		data.put("2100@410000","2005");
		data.put("2011@410000","2005");
		data.put("2005@410000","2005");
		data.put("2019@410000","2005");
		data.put("0@350000","2005");
		data.put("2088@440000","2088");

	}
	
	public static String getQueryInscComCode(String inscComCode, String areId){
		if(StringUtil.isEmpty(inscComCode) || StringUtil.isEmpty(areId)){
			return "2005";
		}
		if(data.containsKey(inscComCode+"@"+areId)){
			return data.get(inscComCode+"@"+areId);
		}else if (data.containsKey("0"+"@"+areId)){
			return data.get("0"+"@"+areId);
		}else if (data.containsKey(inscComCode+"@"+"0")){
			return data.get(inscComCode+"@"+"0");
		}else{
			return "2005";
		}
	}
	/**
	 * 1105	0	精友系	2085	利宝互助保险公司
1134	0	精友系	2090	浙商财产保险股份有限公司
1134	0	精友库	2090	浙商财产保险股份有限公司
12086	0	精友库	2073	泰山财产保险股份有限公司
12280	0	精友库	2025	天安保险股份有限公司
12448	0	人保系	2077	富德财产保险股份有限公司
1336	0	精友系	2095	紫金财产保险股份有限公司
1854	0	人保系	2096	信达财产保险股份有限公司
276	0	精友系	2023	华泰财产保险股份有限公司
277	0	人保系	2011	中国太平洋财产保险股份有限公司
278	0	人保系	2022	永诚财产保险股份有限公司
332	0	精友系	2042	都邦财产保险股份有限公司
334	0	精友系	2007	中国平安财产保险股份有限公司
376	0	精友系	2016	太平保险有限公司
422	0	人保系	2002	中国人寿财产保险股份有限公司
424	0	人保系	2019	阳光财产保险股份有限公司
427	0	精友库	2041	渤海财产保险股份有限公司
428	0	精友系	2043	华安财产保险股份有限公司
429	0	精友系	2046	永安财产保险股份有限公司
444	0	精友系	2027	中华联合财产保险股份有限公司
525	0	人保系	2021	中国大地财产保险股份有限公司
84	0	精友系	2088	鼎和财产保险股份有限公司
9430	0	精友系	2044	众诚汽车保险股份有限公司
0	110100	精友系		
398	120000	精友系	2024	安邦财产保险股份有限公司
342	120100	精友系	2075	三星火灾海上保险中国有限公司
0	210000	精友系		
0	320000	精友系		
0	330000	精友系		
0	350000	人保系(针对人保所有公司)		
0	350200	精友系		
1336	350200	精友系	2095	紫金财产保险股份有限公司
1854	370000	精友系	2096	信达财产保险股份有限公司
188	370000	精友库	2086	长安责任保险股份有限公司
333	370000	人保系	2005	中国人民财产保险股份有限公司
355	370000	精友库	2066	民安保险股份有限公司
2181	410000	人保系	2100	国元农业保险股份有限公司
277	410000	人保系	2011	中国太平洋财产保险股份有限公司
333	410000	河南人保系	2005	中国人民财产保险股份有限公司
424	410000	人保系	2019	阳光财产保险股份有限公司
0	420000	精友系		
428	420100	精友系	2043	华安财产保险股份有限公司
525	420100	精友系	2021	中国大地财产保险股份有限公司
0	430000	精友系		
332	440000	精友系	2042	都邦财产保险股份有限公司
84	440000	广州鼎和系	2088	鼎和财产保险股份有限公司
0	440300	精友系		
0	500000	精友系		
0	510000	精友系		
0	610000	精友系		

	 */
}
